In [56]:
import numpy as np
import pandas as pd
list_1=['a','b','c','d']
labels=[1,2,3,4]
ser_1=pd.Series(data=list_1,index=labels)
ser_1

1    a
2    b
3    c
4    d
dtype: object

In [57]:
arr_1=np.array([1,2,3,4])
ser_2=pd.Series(arr_1)
ser_2

0    1
1    2
2    3
3    4
dtype: int32

In [58]:
ser_2.dtype

dtype('int32')

In [59]:
ser_2+ser_2

0    2
1    4
2    6
3    8
dtype: int32

In [60]:
ser_2-ser_2

0    0
1    0
2    0
3    0
dtype: int32

In [61]:
ser_2/ser_2

0    1.0
1    1.0
2    1.0
3    1.0
dtype: float64

In [62]:
ser_2*ser_2

0     1
1     4
2     9
3    16
dtype: int32

In [63]:
np.exp(ser_2)

0     2.718282
1     7.389056
2    20.085537
3    54.598150
dtype: float64

In [64]:
#creating dictionary
dic_1={'f_name':'Vijay','l_name':"S",'age':31}
ser_3=pd.Series(dic_1)

ser_3

f_name    Vijay
l_name        S
age          31
dtype: object

In [65]:
ser_3['f_name']

'Vijay'

In [66]:
ser_3['l_name']

'S'

In [67]:
ser_3['age']

31

In [68]:
ser_4=pd.Series({4:5,5:6,6:7,7:8},name='random')
ser_4

4    5
5    6
6    7
7    8
Name: random, dtype: int64

In [69]:
ser_4.name

'random'

In [70]:
#DataFrames
#Creating DataFrames

In [71]:
#Creating random array with numpy

arr_2=np.random.randint(10,50,size=(2,3))
arr_2

array([[35, 35, 11],
       [49, 39, 12]])

In [72]:
#creating dataframe with pandas
df_1=pd.DataFrame(arr_2,['A','B'],['C','D','E'])
df_1

    C   D   E
A  35  35  11
B  49  39  12

In [73]:
#getting columns
df_1['C']

A    35
B    49
Name: C, dtype: int32

In [74]:
#getting two column from dataframe
df_1[['C','D']]

    C   D
A  35  35
B  49  39

In [75]:
#getting row with columns

df_1.loc['A']

C    35
D    35
E    11
Name: A, dtype: int32

In [76]:
#getting rows with column number
df_1.iloc[1]

C    49
D    39
E    12
Name: B, dtype: int32

In [77]:
#specific information with row and column name

df_1.loc['A','C']

35

In [78]:
#getting information with multiple rows and columns
df_1.loc[['A','B'],['D','E']]

    D   E
A  35  11
B  39  12

In [79]:
#creating new column with adding multiple columns
df_1['Total']=df_1['C']+df_1['D']+df_1['E']
df_1

    C   D   E  Total
A  35  35  11     81
B  49  39  12    100

In [80]:
#creating dictionary
dict_2={'C':44,'D':12,'E':25}
#creating new row
new_row=pd.Series(dict_2,name='F')
new_row

C    44
D    12
E    25
Name: F, dtype: int64

In [81]:
#adding a row in a dataframe
df_1=df_1.append(new_row)
df_1

      C     D     E  Total
A  35.0  35.0  11.0   81.0
B  49.0  39.0  12.0  100.0
F  44.0  12.0  25.0    NaN

In [82]:
#droping the row from the table
df_1.drop('B',axis=0,inplace=True)

In [83]:
df_1

      C     D     E  Total
A  35.0  35.0  11.0   81.0
F  44.0  12.0  25.0    NaN

In [84]:
#creating a column
df_1['Sex']=['Men','Women']
#making this column as index
df_1.set_index('Sex',inplace=True)

In [85]:
df_1

          C     D     E  Total
Sex
Men    35.0  35.0  11.0   81.0
Women  44.0  12.0  25.0    NaN

In [86]:
df_2

   one  two  Multi
a  1.0  1.0    1.0
b  2.0  2.0    4.0
c  3.0  3.0    9.0
d  NaN  4.0    NaN

In [87]:
#multiplying two column and getting information in new column
df_2['Multi']=df_2['one']*df_2['two']
df_2

   one  two  Multi
a  1.0  1.0    1.0
b  2.0  2.0    4.0
c  3.0  3.0    9.0
d  NaN  4.0    NaN

In [88]:
#creating a divide row with the assign method.

df_2.assign(div=df_2['one']/df_2['two'])

   one  two  Multi  div
a  1.0  1.0    1.0  1.0
b  2.0  2.0    4.0  1.0
c  3.0  3.0    9.0  1.0
d  NaN  4.0    NaN  NaN

In [89]:
df_2.assign(div=lambda x: (x['one']/x['two']))

   one  two  Multi  div
a  1.0  1.0    1.0  1.0
b  2.0  2.0    4.0  1.0
c  3.0  3.0    9.0  1.0
d  NaN  4.0    NaN  NaN

In [90]:
#type of dataframe

df_1.shape

(2, 4)

In [91]:
#creating dictionary
dic_3={'one':pd.Series([1.,2.,3.],index=['a','b','c']),
       'two':pd.Series([1.,2.,3.,4.],index=['a','b','c','d'])}
dic_3

{'one': a    1.0
 b    2.0
 c    3.0
 dtype: float64,
 'two': a    1.0
 b    2.0
 c    3.0
 d    4.0
 dtype: float64}

In [92]:
#Creating dataframe with dictionary and pandas
df_2=pd.DataFrame(dic_3)
df_2

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [93]:
#from_dict
pd.DataFrame.from_dict(dict([('A',[1,5,7]),('B',[4,6,8] ) ] ))

   A  B
0  1  4
1  5  6
2  7  8

In [94]:
#creating datafrome with index orientation and column name
pd.DataFrame.from_dict(dict([('A',[1,5,7]),('B',[4,6,8] ) ] ),
                      orient='index',columns=['one','two','three'])

   one  two  three
A    1    5      7
B    4    6      8

In [95]:
#This is one way of creating data

df_3=pd.DataFrame({'A':[1.,np.nan,np.nan]})

In [96]:
df_3

     A
0  1.0
1  NaN
2  NaN

In [97]:
#creating data frame
df_4=pd.DataFrame({'A':[1.,2.,3.]})
df_4

     A
0  1.0
1  2.0
2  3.0

In [100]:
#Creating an arry with 2,3 mean 2 rows and 3 columns
arr_2=np.random.randint(10,50,size=(2,3))
arr_2

array([[12, 11, 24],
       [25, 47, 12]])

In [126]:
#putting the array to a dataframe
df_1=pd.DataFrame(arr_2,['A','B'],['C','D','E'])
df_1

    C   D   E
A  12  11  24
B  25  47  12

In [103]:

print('Greater than 40\n',df_1>40)

Greater than 40
        C      D      E
A  False  False  False
B  False   True  False

In [104]:
# it ge le eq ne
print('Greater than 40\n',df_1.gt(40.0))

Greater than 40
        C      D      E
A  False  False  False
B  False   True  False

In [107]:
#creating a boolean with condition
bool_1=df_1>=45.0
bool_1

       C      D      E
A  False  False  False
B  False   True  False

In [112]:
#getting value based on boolean
df_1[bool_1]

    C     D   E
A NaN   NaN NaN
B NaN  47.0 NaN

In [114]:
df_1['E']>40
df_1[df_1['E']>40]

Empty DataFrame
Columns: [C, D, E]
Index: []

In [122]:
#creating a dataframe

df_1=df_2[df_1['E']>5]
df_1

Empty DataFrame
Columns: [C, D, E]
Index: []

In [124]:
df_2

Empty DataFrame
Columns: [C, D, E]
Index: []

In [127]:
df_1

    C   D   E
A  12  11  24
B  25  47  12

In [129]:
#Creating dataframe with bool and getting specific column

print   (      df_1  [  df_1['E']>20   ]           [['C','D']]      )

    C   D
A  12  11

In [130]:
arr_3=np.array ([   [1,2,3],   [4,5,6] ,  [7,8,9]               ]         )
arr_3

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [132]:
#Creating data frome with rows and column 
df_4=pd.DataFrame(arr_3, ['A','B','C'], ['X','Y','Z'])
df_4

   X  Y  Z
A  1  2  3
B  4  5  6
C  7  8  9

In [135]:
#DataFrame        #Boolean

df_4       [      (df_4['X']  >3)            ]

   X  Y  Z
B  4  5  6
C  7  8  9